app/Controllers/ClientesController.php

    public function index(): string
    {
        $clientes = new ClientesModel();
        $datos['datos']=$clientes->findAll();
---
SELECT *
FROM `clientes`

    public function agregarCliente(){

        $datos =[
            'cliente_id' =>$this->request->getVar('txtId'),
            'nombre'=>$this->request->getVar('txtNombre'),
            'apellido'=>$this->request->getVar('txtApellido'),
            'nit'=>$this->request->getVar('txtNit'),
            'telefono'=>$this->request->getVar('txtTelefono'),
            'correo_electronico'=>$this->request->getVar('txtCorreo'),
            'direccion'=>$this->request->getVar('txtDireccion'),
            'contrasenia'=>$this->request->getVAr('txtContraseña')
        ];

        $clientes = new ClientesModel();
        $clientes->insert($datos);
---
INSERT INTO `clientes` (`cliente_id`, `nombre`, `apellido`, `nit`, `telefono`, `correo_electronico`, `direccion`) VALUES ('33', 'Gary', 'SC', '5812475', '40404502', 'ggetsdt@gmail.com', '0Av 6-90')

    public function eliminarCliente($id=null){
        $clientes = new ClientesModel();
        $clientes->delete($id);
---
DELETE FROM `clientes`
WHERE `cliente_id` IN ('33')

    public function buscarCliente($id=null){
        $clientes = new ClientesModel();
        $datos['datos']=$clientes->where('cliente_id',$id)->first();
---
SELECT *
FROM `clientes`
WHERE `cliente_id` = '33'
 LIMIT 1