app/Controllers/HotelesController.php

    public function index(): string
    {
        $hoteles = new HotelesModel();
        $datos['datos']=$hoteles->findAll();
---
SELECT *
FROM `hoteles`

    public function buscarHotel($id=null){
        $hoteles = new HotelesModel();
        $datos['datos']=$hoteles->where('hotel_id',$id)->first();
---
SELECT *
FROM `hoteles`
WHERE `hotel_id` = '1'
 LIMIT 1