app/Controllers/ReservacionesController.php

SELECT *
FROM `reservaciones`
---
    public function index(): string
    {
        $reservaciones = new ReservacionesModel();
        $datos['datos']=$reservaciones->findAll();